[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/StrykerDemo_MUTATION_Testing/ArrayTools/ArraySearch.cs:7:47
     {
         public static int FindIndex(int[] array, int element)
         {
-            for (int i = 0; i < array.Length; i++)
+            for (int i = 0; i < array.Length; i--)
             {
                 if (array[i] == element)
killedBy: ArrayToolsTest.ArraySearchTests.CheckArrayFindElement; ArrayToolsTest.ArraySearchTests.CheckArrayFindElement_ThrowsExcetionWhenOutOfBounds
